yangyuxuan203/INA226/Core/Src/esp8266_onenet_at.c
#include "esp8266_onenet_at.h"
#include "esp8266_udp.h"
#include "usart.h"
#include "cmsis_os.h"
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#define ESP8266_ONENET_AT_DMA_RX_SIZE 2048U
#define ESP8266_ONENET_AT_RSP_SIZE    768
#ifndef ESP8266_ONENET_AT_VERBOSE_LOG
#define ESP8266_ONENET_AT_VERBOSE_LOG 0U
#endif
#define ESP8266_ONENET_AT_BOOT_WAIT_MS 1500U
#define ESP8266_ONENET_AT_ESCAPE_WAIT_MS 1200U
#define ESP8266_ONENET_AT_READY_RETRY 5U
#define ESP8266_ONENET_TCP_STREAM_SIZE 2048U
#define ESP8266_ONENET_SNTP_RETRY_COUNT 3U
#define ESP8266_ONENET_SNTP_READY_WAIT_MS 1500U
#define ESP8266_ONENET_SNTP_QUERY_TIMEOUT_MS 2500U

typedef enum
{
    ESP8266_RAW_FIND_IPD = 0,
    ESP8266_RAW_READ_IPD_LENGTH,
    ESP8266_RAW_SKIP_IPD_HEADER,
    ESP8266_RAW_READ_IPD_PAYLOAD
} ESP8266_RawState_t;

static uint8_t g_onenet_dma_rx[ESP8266_ONENET_AT_DMA_RX_SIZE];
static uint16_t g_onenet_dma_old_pos = 0;
static volatile uint32_t g_onenet_dma_wrap_count = 0U;
static uint32_t g_onenet_dma_old_wrap_count = 0U;
static uint8_t g_onenet_dma_overflow = 0U;
static uint8_t g_onenet_dma_started = 0;
static ESP8266_RawState_t g_onenet_raw_state = ESP8266_RAW_FIND_IPD;
static uint8_t g_onenet_ipd_prefix_pos = 0U;
static uint32_t g_onenet_ipd_remaining = 0U;
static uint8_t g_onenet_tcp_stream[ESP8266_ONENET_TCP_STREAM_SIZE];
static uint16_t g_onenet_tcp_head = 0U;
static uint16_t g_onenet_tcp_tail = 0U;
static uint16_t g_onenet_tcp_count = 0U;
static uint8_t g_onenet_tcp_overflow = 0U;
static char g_onenet_link_event[32];
static uint8_t g_onenet_link_event_len = 0U;
static uint8_t g_onenet_link_closed = 0U;
static uint8_t g_onenet_sntp_configured = 0U;

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    if (huart == &huart2)
    {
        g_onenet_dma_wrap_count++;
    }
}

static void ESP8266_ONENET_AT_ResetStreamParser(void)
{
    g_onenet_raw_state = ESP8266_RAW_FIND_IPD;
    g_onenet_ipd_prefix_pos = 0U;
    g_onenet_ipd_remaining = 0U;
    g_onenet_tcp_head = 0U;
    g_onenet_tcp_tail = 0U;
    g_onenet_tcp_count = 0U;
    g_onenet_tcp_overflow = 0U;
    g_onenet_link_event_len = 0U;
    g_onenet_link_event[0] = '\0';
    g_onenet_link_closed = 0U;
}

static void ESP8266_ONENET_AT_RecordLinkByte(uint8_t byte)
{
    if (g_onenet_link_event_len < (sizeof(g_onenet_link_event) - 1U))
    {
        g_onenet_link_event[g_onenet_link_event_len++] = (char)byte;
    }
    else
    {
        memmove(g_onenet_link_event, &g_onenet_link_event[1],
                sizeof(g_onenet_link_event) - 2U);
        g_onenet_link_event[sizeof(g_onenet_link_event) - 2U] = (char)byte;
        g_onenet_link_event_len = sizeof(g_onenet_link_event) - 1U;
    }
    g_onenet_link_event[g_onenet_link_event_len] = '\0';

    if (strstr(g_onenet_link_event, "WIFI DISCONNECT") != NULL ||
        strstr(g_onenet_link_event, "CLOSED") != NULL ||
        strstr(g_onenet_link_event, "link is not valid") != NULL)
    {
        g_onenet_link_closed = 1U;
    }
}

static void ESP8266_ONENET_AT_PushTcpByte(uint8_t byte)
{
    if (g_onenet_tcp_count >= sizeof(g_onenet_tcp_stream))
    {
        g_onenet_tcp_overflow = 1U;
        return;
    }

    g_onenet_tcp_stream[g_onenet_tcp_head++] = byte;
    if (g_onenet_tcp_head >= sizeof(g_onenet_tcp_stream))
    {
        g_onenet_tcp_head = 0U;
    }
    g_onenet_tcp_count++;
}

static uint8_t ESP8266_ONENET_AT_FeedRawByte(uint8_t byte)
{
    static const char prefix[] = "+IPD,";

    if (g_onenet_raw_state == ESP8266_RAW_READ_IPD_PAYLOAD)
    {
        ESP8266_ONENET_AT_PushTcpByte(byte);
        if (--g_onenet_ipd_remaining == 0U)
        {
            g_onenet_raw_state = ESP8266_RAW_FIND_IPD;
            g_onenet_ipd_prefix_pos = 0U;
        }
        return 1U;
    }

    if (g_onenet_raw_state == ESP8266_RAW_FIND_IPD)
    {
        if (byte == (uint8_t)prefix[g_onenet_ipd_prefix_pos])
        {
            g_onenet_ipd_prefix_pos++;
            if (g_onenet_ipd_prefix_pos == (sizeof(prefix) - 1U))
            {
                g_onenet_raw_state = ESP8266_RAW_READ_IPD_LENGTH;
                g_onenet_ipd_remaining = 0U;
            }
            return 1U;
        }

        g_onenet_ipd_prefix_pos = (byte == (uint8_t)prefix[0]) ? 1U : 0U;
        ESP8266_ONENET_AT_RecordLinkByte(byte);
        return g_onenet_ipd_prefix_pos != 0U ? 1U : 0U;
    }

    if (g_onenet_raw_state == ESP8266_RAW_READ_IPD_LENGTH)
    {
        if (byte >= '0' && byte <= '9')
        {
            g_onenet_ipd_remaining = g_onenet_ipd_remaining * 10U + (uint32_t)(byte - '0');
            if (g_onenet_ipd_remaining > 65535U)
            {
                g_onenet_raw_state = ESP8266_RAW_FIND_IPD;
                g_onenet_ipd_prefix_pos = 0U;
                g_onenet_tcp_overflow = 1U;
            }
        }
        else if (byte == ':')
        {
            g_onenet_raw_state = g_onenet_ipd_remaining == 0U ?
                                  ESP8266_RAW_FIND_IPD : ESP8266_RAW_READ_IPD_PAYLOAD;
        }
        else if (byte == ',')
        {
            g_onenet_raw_state = ESP8266_RAW_SKIP_IPD_HEADER;
        }
        else
        {
            g_onenet_raw_state = ESP8266_RAW_FIND_IPD;
            g_onenet_ipd_prefix_pos = 0U;
        }
        return 1U;
    }

    if (g_onenet_raw_state == ESP8266_RAW_SKIP_IPD_HEADER && byte == ':')
    {
        g_onenet_raw_state = g_onenet_ipd_remaining == 0U ?
                              ESP8266_RAW_FIND_IPD : ESP8266_RAW_READ_IPD_PAYLOAD;
    }
    return 1U;
}

static uint8_t ESP8266_ONENET_AT_PeekTcp(uint16_t offset)
{
    uint16_t position = (uint16_t)(g_onenet_tcp_tail + offset);
    if (position >= sizeof(g_onenet_tcp_stream))
    {
        position = (uint16_t)(position - sizeof(g_onenet_tcp_stream));
    }
    return g_onenet_tcp_stream[position];
}

static void ESP8266_ONENET_AT_DropTcp(uint16_t length)
{
    g_onenet_tcp_tail = (uint16_t)((g_onenet_tcp_tail + length) % sizeof(g_onenet_tcp_stream));
    g_onenet_tcp_count = (uint16_t)(g_onenet_tcp_count - length);
}

/* Returns 0 for a complete packet, 1 when more bytes are needed, 2 on corruption. */
static uint8_t ESP8266_ONENET_AT_TryPopMqtt(uint8_t *payload, uint16_t capacity,
                                            uint16_t *out_length)
{
    uint32_t remaining_length = 0U;
    uint32_t multiplier = 1U;
    uint32_t total_length;
    uint16_t offset = 1U;
    uint16_t index;
    uint8_t encoded;

    if (g_onenet_tcp_overflow)
    {
        ESP8266_ONENET_AT_ResetStreamParser();
        return 2U;
    }
    if (g_onenet_tcp_count < 2U)
    {
        return 1U;
    }

    do
    {
        if (offset >= g_onenet_tcp_count)
        {
            return 1U;
        }
        if (offset > 4U)
        {
            ESP8266_ONENET_AT_ResetStreamParser();
            return 2U;
        }
        encoded = ESP8266_ONENET_AT_PeekTcp(offset++);
        remaining_length += (uint32_t)(encoded & 0x7FU) * multiplier;
        multiplier *= 128U;
    } while ((encoded & 0x80U) != 0U);

    total_length = (uint32_t)offset + remaining_length;
    if (total_length > sizeof(g_onenet_tcp_stream))
    {
        ESP8266_ONENET_AT_ResetStreamParser();
        return 2U;
    }
    if (g_onenet_tcp_count < total_length)
    {
        return 1U;
    }
    if (total_length >= capacity)
    {
        ESP8266_ONENET_AT_DropTcp((uint16_t)total_length);
        return 2U;
    }

    for (index = 0U; index < total_length; index++)
    {
        payload[index] = ESP8266_ONENET_AT_PeekTcp(index);
    }
    ESP8266_ONENET_AT_DropTcp((uint16_t)total_length);
    *out_length = (uint16_t)total_length;
    return 0U;
}

static void ESP8266_ONENET_AT_ClearUartErrors(void)
{
    __HAL_UART_CLEAR_OREFLAG(&huart2);
    __HAL_UART_CLEAR_FEFLAG(&huart2);
    __HAL_UART_CLEAR_NEFLAG(&huart2);
    __HAL_UART_CLEAR_PEFLAG(&huart2);
    huart2.ErrorCode = HAL_UART_ERROR_NONE;
}

static uint8_t ESP8266_ONENET_AT_RestartDma(void)
{
    g_onenet_dma_started = 0U;
    HAL_UART_AbortReceive(&huart2);
    ESP8266_ONENET_AT_ClearUartErrors();

