yangyuxuan203/INA226/Core/Src/esp8266_onenet_at.c
    g_onenet_dma_wrap_count = 0U;
    g_onenet_dma_old_wrap_count = 0U;
    g_onenet_dma_overflow = 0U;

    if (HAL_UART_Receive_DMA(&huart2, g_onenet_dma_rx, ESP8266_ONENET_AT_DMA_RX_SIZE) != HAL_OK)
    {
        g_onenet_dma_started = 0;
        return 1;
    }

    __HAL_DMA_DISABLE_IT(huart2.hdmarx, DMA_IT_HT);
    g_onenet_dma_old_pos = 0;
    g_onenet_dma_started = 1;
    ESP8266_ONENET_AT_ResetStreamParser();
    return 0;
}

static uint8_t ESP8266_ONENET_AT_EnsureDma(void)
{
    if (!g_onenet_dma_started ||
        huart2.RxState != HAL_UART_STATE_BUSY_RX ||
        huart2.ErrorCode != HAL_UART_ERROR_NONE)
    {
        uint8_t was_started = g_onenet_dma_started;
        uint8_t result = ESP8266_ONENET_AT_RestartDma();
        if (result == 0U && was_started != 0U)
        {
            g_onenet_dma_overflow = 1U;
        }
        return result;
    }

    return 0;
}

uint8_t ESP8266_ONENET_AT_StartDma(void)
{
    if (g_onenet_dma_started)
    {
        return ESP8266_ONENET_AT_EnsureDma();
    }

    HAL_UART_AbortTransmit(&huart2);
    return ESP8266_ONENET_AT_RestartDma();
}

void ESP8266_ONENET_AT_ClearRx(void)
{
    uint16_t pos;
    uint32_t wrap_count;
    uint32_t wrap_count_after;

    if (ESP8266_ONENET_AT_EnsureDma() != 0)
    {
        return;
    }

    do
    {
        wrap_count = g_onenet_dma_wrap_count;
        pos = (uint16_t)(ESP8266_ONENET_AT_DMA_RX_SIZE -
                         __HAL_DMA_GET_COUNTER(huart2.hdmarx));
        if (pos >= ESP8266_ONENET_AT_DMA_RX_SIZE)
        {
            pos = 0U;
        }
        wrap_count_after = g_onenet_dma_wrap_count;
    }
    while (wrap_count != wrap_count_after);

    g_onenet_dma_old_pos = pos;
    g_onenet_dma_old_wrap_count = wrap_count;
    g_onenet_dma_overflow = 0U;
    ESP8266_ONENET_AT_ResetStreamParser();
}

static int16_t ESP8266_ONENET_AT_ReadDmaByte(void)
{
    uint16_t pos;
    uint8_t ch;
    uint32_t wrap_count;
    uint32_t wrap_count_after;
    uint32_t wrap_delta;
    uint32_t available;

    if (ESP8266_ONENET_AT_EnsureDma() != 0)
    {
        return -1;
    }

    do
    {
        wrap_count = g_onenet_dma_wrap_count;
        pos = (uint16_t)(ESP8266_ONENET_AT_DMA_RX_SIZE -
                         __HAL_DMA_GET_COUNTER(huart2.hdmarx));
        if (pos >= ESP8266_ONENET_AT_DMA_RX_SIZE)
        {
            pos = 0U;
        }
        wrap_count_after = g_onenet_dma_wrap_count;
    }
    while (wrap_count != wrap_count_after);

    wrap_delta = wrap_count - g_onenet_dma_old_wrap_count;
    if (wrap_delta == 0U)
    {
        if (pos < g_onenet_dma_old_pos)
        {
            g_onenet_dma_overflow = 1U;
            g_onenet_dma_old_pos = pos;
            return -1;
        }
        available = (uint32_t)(pos - g_onenet_dma_old_pos);
    }
    else
    {
        available = (wrap_delta - 1U) * ESP8266_ONENET_AT_DMA_RX_SIZE;
        available += ESP8266_ONENET_AT_DMA_RX_SIZE - g_onenet_dma_old_pos;
        available += pos;
    }

    if (available == 0U)
    {
        return -1;
    }
    if (available > ESP8266_ONENET_AT_DMA_RX_SIZE)
    {
        g_onenet_dma_overflow = 1U;
        g_onenet_dma_old_pos = pos;
        g_onenet_dma_old_wrap_count = wrap_count;
        return -1;
    }

    ch = g_onenet_dma_rx[g_onenet_dma_old_pos++];
    if (g_onenet_dma_old_pos >= ESP8266_ONENET_AT_DMA_RX_SIZE)
    {
        g_onenet_dma_old_pos = 0;
        g_onenet_dma_old_wrap_count++;
    }

    return ch;
}

uint8_t ESP8266_ONENET_AT_SendBytes(const uint8_t *data, uint16_t len)
{
    uint8_t ret;

    if (data == NULL || len == 0U)
    {
        return 0;
    }

    (void)ESP8266_ONENET_AT_EnsureDma();
    ret = HAL_UART_Transmit(&huart2, (uint8_t *)data, len, 1000U) == HAL_OK ? 0U : 1U;
    if (huart2.ErrorCode != HAL_UART_ERROR_NONE)
    {
        (void)ESP8266_ONENET_AT_RestartDma();
    }
    return ret;
}

uint8_t ESP8266_ONENET_AT_SendRaw(const char *s)
{
    if (s == NULL)
    {
        return 1;
    }
    return ESP8266_ONENET_AT_SendBytes((const uint8_t *)s, (uint16_t)strlen(s));
}

uint16_t ESP8266_ONENET_AT_ReadUntil(char *buf, uint16_t len, const char *expect, uint32_t timeout_ms)
{
    uint32_t start = HAL_GetTick();
    uint16_t pos = 0;
    int16_t ch;

    if (buf == NULL || len == 0U)
    {
        return 0;
    }
    buf[0] = '\0';

    while ((HAL_GetTick() - start) < timeout_ms && pos < (len - 1U))
    {
        ch = ESP8266_ONENET_AT_ReadDmaByte();
        if (ch >= 0)
        {
            if (ESP8266_ONENET_AT_FeedRawByte((uint8_t)ch) == 0U)
            {
                buf[pos++] = (char)ch;
                buf[pos] = '\0';
                if (expect != NULL && strstr(buf, expect) != NULL)
                {
                    break;
                }
            }
        }
        else
        {
            osDelay(1U);
        }
    }

    return pos;
}

uint8_t ESP8266_ONENET_AT_SendCmd(const char *cmd, const char *expect, uint32_t timeout_ms)
{
    char rx[ESP8266_ONENET_AT_RSP_SIZE];
    uint16_t rx_len;
    uint8_t retry;

    rx[0] = '\0';
    for (retry = 0; retry < 2U; retry++)
    {
        ESP8266_ONENET_AT_ClearRx();
        if (ESP8266_ONENET_AT_SendRaw(cmd) != 0 || ESP8266_ONENET_AT_SendRaw("\r\n") != 0)
        {
            (void)ESP8266_ONENET_AT_RestartDma();
            osDelay(50U);
            continue;
        }

        rx_len = ESP8266_ONENET_AT_ReadUntil(rx, sizeof(rx), expect, timeout_ms);
        if (expect == NULL || strstr(rx, expect) != NULL)
        {
            return 0;
        }
        if (strcmp(cmd, ESP8266_AT_CMD_CLOSE) == 0 && strstr(rx, ESP8266_AT_RSP_ERROR) != NULL)
        {
            return 0;
        }

        if (rx_len != 0U || retry != 0U)
        {
            break;
        }

        if (ESP8266_ONENET_AT_VERBOSE_LOG)
        {
            printf("ONENET AT empty rsp, restart USART2 RX DMA and retry cmd=[%s]\r\n", cmd);
        }
        (void)ESP8266_ONENET_AT_RestartDma();
        osDelay(100U);
    }

    if (ESP8266_ONENET_AT_VERBOSE_LOG) printf("ONENET AT fail cmd=[%s] rsp=[%s]\r\n", cmd, rx);
    return 1;
}

