yangyuxuan203/INA226/Core/Src/esp8266_onenet_at.c
static void ESP8266_ONENET_AT_PrepareBeforeInit(void)
{
    (void)ESP8266_ONENET_AT_StartDma();

    osDelay(ESP8266_ONENET_AT_BOOT_WAIT_MS);
    ESP8266_ONENET_AT_ClearRx();

    /* Leave possible transparent transmission mode from a previous run. */
    (void)ESP8266_ONENET_AT_SendRaw("+++");
    osDelay(ESP8266_ONENET_AT_ESCAPE_WAIT_MS);
    ESP8266_ONENET_AT_ClearRx();

    osDelay(200U);
    ESP8266_ONENET_AT_ClearRx();
}

uint8_t ESP8266_ONENET_AT_JoinAp(const char *ssid, const char *password)
{
    char cmd[160];
    char rx[ESP8266_ONENET_AT_RSP_SIZE];
    uint8_t retry;

    if (ssid == NULL || password == NULL)
    {
        return 1;
    }

    snprintf(cmd, sizeof(cmd), "AT+CWJAP=\"%s\",\"%s\"", ssid, password);

    for (retry = 0; retry < 3U; retry++)
    {
        ESP8266_ONENET_AT_ClearRx();
        if (ESP8266_ONENET_AT_VERBOSE_LOG) printf("ONENET ESP8266: CWJAP try %u\r\n", retry + 1U);
        if (ESP8266_ONENET_AT_SendRaw(cmd) != 0 || ESP8266_ONENET_AT_SendRaw("\r\n") != 0)
        {
            continue;
        }

        ESP8266_ONENET_AT_ReadUntil(rx, sizeof(rx), ESP8266_AT_RSP_OK, 20000);
        if (ESP8266_ONENET_AT_VERBOSE_LOG) printf("ONENET ESP8266: CWJAP rsp=[%s]\r\n", rx);

        if (strstr(rx, ESP8266_AT_RSP_GOT_IP) != NULL ||
            strstr(rx, ESP8266_AT_RSP_WIFI_CONNECTED) != NULL ||
            strstr(rx, ESP8266_AT_RSP_OK) != NULL)
        {
            return 0;
        }

        osDelay(1000U);
    }

    return ESP8266_ONENET_AT_SendCmd("AT+CWJAP?", ESP8266_AT_RSP_OK, 3000);
}

static uint8_t ESP8266_ONENET_AT_ResponseHasLine(const char *response,
                                                  const char *expected)
{
    const char *line;
    const char *end;
    size_t expected_len;

    if (response == NULL || expected == NULL || expected[0] == '\0')
    {
        return 0U;
    }

    expected_len = strlen(expected);
    line = response;
    while (*line != '\0')
    {
        while (*line == '\r' || *line == '\n')
        {
            line++;
        }
        if (*line == '\0')
        {
            break;
        }

        end = strpbrk(line, "\r\n");
        if (end == NULL)
        {
            end = line + strlen(line);
        }
        if ((size_t)(end - line) == expected_len &&
            memcmp(line, expected, expected_len) == 0)
        {
            return 1U;
        }
        line = end;
    }

    return 0U;
}

uint8_t ESP8266_ONENET_AT_StartTcp(const char *host, uint16_t port)
{
    char cmd[128];
    char rx[ESP8266_ONENET_AT_RSP_SIZE];

    if (host == NULL)
    {
        return 1;
    }

    snprintf(cmd, sizeof(cmd), "AT+CIPSTART=\"TCP\",\"%s\",%u", host, port);
    ESP8266_ONENET_AT_ClearRx();
    if (ESP8266_ONENET_AT_SendRaw(cmd) != 0U ||
        ESP8266_ONENET_AT_SendRaw("\r\n") != 0U)
    {
        return 1U;
    }

    (void)ESP8266_ONENET_AT_ReadUntil(rx, sizeof(rx),
                                      "CONNECT\r\n", 5000U);
    return (ESP8266_ONENET_AT_ResponseHasLine(
                rx, ESP8266_AT_RSP_CONNECT) != 0U ||
            ESP8266_ONENET_AT_ResponseHasLine(
                rx, "ALREADY CONNECTED") != 0U) ? 0U : 1U;
}

uint8_t ESP8266_ONENET_AT_SendData(const uint8_t *data, uint16_t len)
{
    char cmd[32];
    char rx[ESP8266_ONENET_AT_RSP_SIZE];

    if (data == NULL || len == 0U)
    {
        return 1;
    }

    snprintf(cmd, sizeof(cmd), "AT+CIPSEND=%u", len);

    if (ESP8266_ONENET_AT_SendRaw(cmd) != 0 || ESP8266_ONENET_AT_SendRaw("\r\n") != 0)
    {
        return 1;
    }

    ESP8266_ONENET_AT_ReadUntil(rx, sizeof(rx), ESP8266_AT_RSP_SEND_PROMPT, 2000);
    if (strchr(rx, '>') == NULL)
    {
        return 1;
    }

    if (ESP8266_ONENET_AT_SendBytes(data, len) != 0)
    {
        return 1;
    }

    ESP8266_ONENET_AT_ReadUntil(rx, sizeof(rx), ESP8266_AT_RSP_SEND_OK, 3000);
    return strstr(rx, ESP8266_AT_RSP_SEND_OK) != NULL ? 0 : 1;
}

ESP8266_ONENET_AT_Result_t ESP8266_ONENET_AT_WaitTcpPacket(
    uint8_t *payload, uint16_t len, uint16_t *out_len, uint32_t timeout_ms)
{
    uint32_t start = HAL_GetTick();
    int16_t ch;
    uint8_t packet_result;

    if (payload == NULL || len == 0U || out_len == NULL)
    {
        return ESP8266_ONENET_AT_RX_ERROR;
    }

    *out_len = 0;

    while ((HAL_GetTick() - start) < timeout_ms)
    {
        if (g_onenet_dma_overflow != 0U)
        {
            g_onenet_dma_overflow = 0U;
            ESP8266_ONENET_AT_ResetStreamParser();
            return ESP8266_ONENET_AT_RX_ERROR;
        }

        packet_result = ESP8266_ONENET_AT_TryPopMqtt(payload, len, out_len);
        if (packet_result == 0U)
        {
            return ESP8266_ONENET_AT_OK;
        }
        if (g_onenet_link_closed)
        {
            return ESP8266_ONENET_AT_LINK_CLOSED;
        }
        if (packet_result == 2U)
        {
            return ESP8266_ONENET_AT_RX_ERROR;
        }

        ch = ESP8266_ONENET_AT_ReadDmaByte();
        if (ch < 0)
        {
            osDelay(1U);
            continue;
        }

        (void)ESP8266_ONENET_AT_FeedRawByte((uint8_t)ch);
    }

    return ESP8266_ONENET_AT_TIMEOUT;
}

static uint8_t ESP8266_ONENET_AT_ParseSntpTime(const char *response,
                                                char *buf,
                                                uint16_t len)
{
    const char *start;
    const char *end;
    uint16_t copy_len;

    if (response == NULL || buf == NULL || len == 0U)
    {
        return 1U;
    }

    start = strstr(response, "CIPSNTPTIME:");
    if (start == NULL)
    {
        return 1U;
    }

    start += strlen("CIPSNTPTIME:");
    while (*start == ' ')
    {
        start++;
    }
    if (strstr(start, "1970") != NULL)
    {
        return 1U;
    }

    end = strpbrk(start, "\r\n");
    if (end == NULL)
    {
        end = start + strlen(start);
    }
    if (end == start)
    {
        return 1U;
    }

    copy_len = (uint16_t)(end - start);
    if (copy_len >= len)
    {
        copy_len = (uint16_t)(len - 1U);
    }
    memcpy(buf, start, copy_len);
    buf[copy_len] = '\0';
    return 0U;
}

uint8_t ESP8266_ONENET_AT_GetSntpTime(char *buf, uint16_t len)
{
    char rx[256];
    uint8_t cfg_ok = 0;
    uint8_t retry;

    if (buf == NULL || len == 0U)
    {
        return 1;
    }
    buf[0] = '\0';

