yangyuxuan203/INA226/Core/Src/esp8266_onenet_at.c
    if (ESP8266_ONENET_AT_SendCmd("AT+CIPSNTPCFG=1,8,\"ntp.aliyun.com\",\"cn.ntp.org.cn\"",
                                  ESP8266_AT_RSP_OK, 3000) == 0)
    {
        cfg_ok = 1;
    }
    else if (ESP8266_ONENET_AT_SendCmd("AT+CIPSNTPCFG=1,8", ESP8266_AT_RSP_OK, 3000) == 0)
    {
        cfg_ok = 1;
    }

    if (!cfg_ok)
    {
        g_onenet_sntp_configured = 0U;
        ESP8266_ONENET_AT_ClearRx();
        if (ESP8266_ONENET_AT_SendRaw("AT+GMR\r\n") == 0)
        {
            ESP8266_ONENET_AT_ReadUntil(rx, sizeof(rx), ESP8266_AT_RSP_OK, 2000);
            if (ESP8266_ONENET_AT_VERBOSE_LOG) printf("ONENET SNTP cfg failed, GMR=[%s]\r\n", rx);
        }
        return 1;
    }
    g_onenet_sntp_configured = 1U;

    for (retry = 0U; retry < ESP8266_ONENET_SNTP_RETRY_COUNT; retry++)
    {
        osDelay(ESP8266_ONENET_SNTP_READY_WAIT_MS);
        ESP8266_ONENET_AT_ClearRx();
        if (ESP8266_ONENET_AT_SendRaw("AT+CIPSNTPTIME?\r\n") != 0)
        {
            return 1;
        }
        ESP8266_ONENET_AT_ReadUntil(rx, sizeof(rx), ESP8266_AT_RSP_OK,
                                    ESP8266_ONENET_SNTP_QUERY_TIMEOUT_MS);
        if (ESP8266_ONENET_AT_VERBOSE_LOG) printf("ONENET SNTP try %u raw=[%s]\r\n", retry + 1U, rx);

        if (ESP8266_ONENET_AT_ParseSntpTime(rx, buf, len) == 0U)
        {
            return 0U;
        }
    }

    return 1U;
}

uint8_t ESP8266_ONENET_AT_QuerySntpTimeOnline(char *buf, uint16_t len)
{
    char rx[256];

    if (buf == NULL || len == 0U)
    {
        return 1U;
    }
    buf[0] = '\0';

    /* The normal online RX path has already drained pending AT text. Do not
     * call ClearRx here: ReadUntil keeps any concurrent +IPD payload queued
     * for the MQTT task instead of discarding it.
     */
    if (!g_onenet_sntp_configured)
    {
        if (ESP8266_ONENET_AT_SendRaw(
                "AT+CIPSNTPCFG=1,8,\"ntp.aliyun.com\",\"cn.ntp.org.cn\"\r\n") != 0U)
        {
            return 1U;
        }
        (void)ESP8266_ONENET_AT_ReadUntil(
            rx, sizeof(rx), ESP8266_AT_RSP_OK,
            ESP8266_ONENET_SNTP_QUERY_TIMEOUT_MS);
        if (strstr(rx, ESP8266_AT_RSP_OK) == NULL)
        {
            if (ESP8266_ONENET_AT_SendRaw(
                    "AT+CIPSNTPCFG=1,8\r\n") != 0U)
            {
                return 1U;
            }
            (void)ESP8266_ONENET_AT_ReadUntil(
                rx, sizeof(rx), ESP8266_AT_RSP_OK,
                ESP8266_ONENET_SNTP_QUERY_TIMEOUT_MS);
            if (strstr(rx, ESP8266_AT_RSP_OK) == NULL)
            {
                return 1U;
            }
        }
        g_onenet_sntp_configured = 1U;
        osDelay(ESP8266_ONENET_SNTP_READY_WAIT_MS);
    }

    if (ESP8266_ONENET_AT_SendRaw("AT+CIPSNTPTIME?\r\n") != 0U)
    {
        return 1U;
    }
    (void)ESP8266_ONENET_AT_ReadUntil(
        rx, sizeof(rx), ESP8266_AT_RSP_OK,
        ESP8266_ONENET_SNTP_QUERY_TIMEOUT_MS);
    if (ESP8266_ONENET_AT_ParseSntpTime(rx, buf, len) != 0U)
    {
        g_onenet_sntp_configured = 0U;
        return 1U;
    }
    return 0U;
}

uint8_t ESP8266_ONENET_AT_InitWiFi(void)
{
    uint8_t retry;
    uint8_t at_ready = 0U;

    if (ESP8266_ONENET_AT_StartDma() != 0)
    {
        return 1;
    }

    ESP8266_ONENET_AT_PrepareBeforeInit();

    if (ESP8266_ONENET_AT_VERBOSE_LOG)
    {
        printf("ONENET ESP8266: wait ready on USART2 PA2/PA3\r\n");
    }

    for (retry = 0U; retry < ESP8266_ONENET_AT_READY_RETRY; retry++)
    {
        uint32_t timeout_ms = 1000U + (uint32_t)retry * 500U;

        if (ESP8266_ONENET_AT_SendCmd(ESP8266_AT_CMD_TEST, ESP8266_AT_RSP_OK, timeout_ms) == 0)
        {
            at_ready = 1U;
            break;
        }

        osDelay(500U);
        ESP8266_ONENET_AT_ClearRx();
    }

    if (!at_ready)
    {
        if (ESP8266_ONENET_AT_VERBOSE_LOG)
        {
            printf("ONENET ESP8266: no AT response after warmup, check USART2 wiring/power\r\n");
        }
        return 1;
    }

    ESP8266_ONENET_AT_SendCmd(ESP8266_AT_CMD_ECHO_OFF, ESP8266_AT_RSP_OK, 1000);
    ESP8266_ONENET_AT_SendCmd(ESP8266_AT_CMD_STATION_MODE, ESP8266_AT_RSP_OK, 1000);
    ESP8266_ONENET_AT_SendCmd(ESP8266_AT_CMD_AUTO_CONN_OFF, ESP8266_AT_RSP_OK, 1000);
    ESP8266_ONENET_AT_SendCmd(ESP8266_AT_CMD_DHCP_ON, ESP8266_AT_RSP_OK, 1000);

    if (ESP8266_ONENET_AT_JoinAp(ESP8266_WIFI_SSID, ESP8266_WIFI_PASSWORD) != 0)
    {
        return 1;
    }

    if (ESP8266_ONENET_AT_SendCmd(ESP8266_AT_CMD_NORMAL_MODE,
                                  ESP8266_AT_RSP_OK, 1000U) != 0U ||
        ESP8266_ONENET_AT_SendCmd(ESP8266_AT_CMD_SINGLE_CONN,
                                  ESP8266_AT_RSP_OK, 1000U) != 0U)
    {
        return 1U;
    }
    (void)ESP8266_ONENET_AT_SendCmd(ESP8266_AT_CMD_IPDINFO_ON,
                                     ESP8266_AT_RSP_OK, 1000U);
    ESP8266_ONENET_AT_SendCmd(ESP8266_AT_CMD_CLOSE, ESP8266_AT_RSP_OK, 1000);
    return 0;
}
